farmerkz/esp32-gnss_logger/sdkconfig.defaults
# Настройки ESP-IDF по умолчанию для ESP32 GNSS Logger

# Целевая архитектура микроконтроллера ESP32
CONFIG_IDF_TARGET="esp32"

# Настройки Flash памяти (Размер 4 МБ)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Настройки скорости загрузки по UART (115200 бод)
CONFIG_ESPTOOLPY_BAUD_115200B=y
CONFIG_ESPTOOLPY_BAUD=115200

# Частота процессора 160 МГц для энергоэффективности
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

# Настройки FreeRTOS (частота тиков 1000 Гц = 1 мс тик)
CONFIG_FREERTOS_HZ=1000

# Поддержка FAT FS и VFS (длинные имена файлов LFN)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE_437=y
# Размер сектора FAT: стандартные SD-карты используют 512 байт
CONFIG_FATFS_SECTOR_512=y

# Поддержка cJSON
CONFIG_CJSON_NESTING_LIMIT=50

# Увеличенный стек для системной задачи событий
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Отключение отладочной информации по умолчанию (уровень WARNING/INFO)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Настройки таблицы разделов (Пользовательские разделы ota_0 и ota_1 по 1.875 МБ)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Включение механизма автоотката (Rollback) при фатальных сбоях новой прошивки
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Увеличение лимита сокетов для работы Web-сервера и FTP одновременно
CONFIG_LWIP_MAX_SOCKETS=16
